#1 Задание

x1 = int(input("Введите значение x1"))
x2 = int(input("Введите значение x2"))
x3 = int(input("Введите значение x3"))
sum = x1 + x2 + x3
print(f"{x1} + {x2} + {x3} = {sum}")
composition = x1 * x2 * x3
print(f"{x1} * {x2} + {x3} = {composition}")