#3 Задание

x1 = int(input("Введите длину первой диагонали:"))
x2 = int(input("Введите длину второй диагонали:"))
s = 1 / 2 * x1 * x2
print(f"{1} / {2} * {x1} * {x2} = {s}")