#2 Задание

x1 = int(input("Введите зарплату за месяц:"))
x2 = int(input("Введите платёж по кредиту:"))
x3 = int(input("Введите задолженность за комунальные услуги:"))
sum = x1 - x2 - x3
print(f"{x1} - {x2} - {x3} = {sum}")